app/controllers/meets_controller.rb

SELECT "meets".* FROM "meets"
---
  def index
    @meets = Meet.all

SELECT  "meets".* FROM "meets" WHERE "meets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @meet = Meet.find(params[:id])

SELECT  "meets".* FROM "meets" WHERE "meets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @meet = Meet.find(params[:id])

SELECT  "meets".* FROM "meets" WHERE "meets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "meets" SET "description" = ?, "updated_at" = ? WHERE "meets"."id" = ?  [["description", "wawawawa"], ["updated_at", "2017-07-27 16:41:03.549609"], ["id", 1]]
---
  def update
    @meet = Meet.find(params[:id])
    @meet.update(meet_params)

SELECT  "meets".* FROM "meets" WHERE "meets"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "meets" WHERE "meets"."id" = ?  [["id", 2]]
---
  def destroy
    @meet = Meet.find(params[:id])
    @meet.destroy

INSERT INTO "meets" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "nongyao"], ["description", "zudui"], ["created_at", "2017-07-27 16:29:21.950570"], ["updated_at", "2017-07-27 16:29:21.950570"]]
---
  def create
    @meet = Meet.new(meet_params)
    @meet.save